app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Learn Ruby"], ["todo_list_id", 2], ["created_at", "2021-07-06 14:11:57.138893"], ["updated_at", "2021-07-06 14:11:57.138893"]]
---
    def create
        @todo_item = @todo_list.todo_items.create(todo_item_params)

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["todo_list_id", 2], ["id", 1], ["LIMIT", 1]]
DELETE FROM "todo_items" WHERE "todo_items"."id" = ?  [["id", 1]]
---
    def destroy
        @todo_item = @todo_list.todo_items.find(params[:id])
        if @todo_item.destroy

UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", "2021-07-06 15:57:51.296903"], ["updated_at", "2021-07-06 15:57:51.297384"], ["id", 2]]
---
    def complete
        @todo_item.update_attribute(:completed_at, Time.now)

UPDATE "todo_items" SET "favourite" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["favourite", "t"], ["updated_at", "2021-07-07 10:34:35.605461"], ["id", 8]]
---
    def favourite
        if @todo_item.favourite?
            @todo_item.update_attribute(:favourite, false)

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT ?  [["todo_list_id", 5], ["id", 8], ["LIMIT", 1]]
---
    def set_todo_item
        @todo_item = @todo_list.todo_items.find(params[:id])

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def set_todo_list
        @todo_list = TodoList.find(params[:todo_list_id])